app/Http/Controllers/DashboardNewController.php

    public function index()
{
    $totalPenduduk = Penduduk::count();
    $lakiLaki = Penduduk::where('jenis_kelamin', 'L')->count();
    $perempuan = Penduduk::where('jenis_kelamin', 'P')->count();
    $penduduk = Penduduk::paginate(10);
---
select count(*) as aggregate from `penduduk`
select count(*) as aggregate from `penduduk` where `jenis_kelamin` = 'L'
select count(*) as aggregate from `penduduk` where `jenis_kelamin` = 'P'
select * from `penduduk` limit 10 offset 0