app/Http/Controllers/PendudukController.php

    public function index()
    {
        $penduduk = Penduduk::paginate(10);
---
select * from `penduduk` limit 10 offset 0
select count(*) as aggregate from `penduduk`